Repository: jgkim/Neologism
Catalog: demo/sites/all/modules/cck/po/*.po
Languages: vi

source: Maximum length
vi: Độ dài tối đa

source: The maximum length of the field in characters. Leave blank for an unlimited size.
vi: Số lượng ký tự tối đa của trường. Bỏ trống nếu muốn không giới hạn.

source: Illegal value for %name.
vi: Giá trị %name không hợp lệ.

source: Rows
vi: Số dòng

source: "Rows" must be a positive integer.
vi: "Số dòng" phải là số dương.

source: Label
vi: Nhãn

source: Group
vi: Nhóm

source: Submit
vi: Đệ trình

source: <Hidden>
vi: <Giấu>

source: Above
vi: Ở trên

source: Add field
vi: Thêm trường

source: Remove
vi: Bỏ ra

source: Cancel
vi: Hủy bỏ

source: Help text
vi: Bản văn trợ giúp

source: Php code
vi: Đoạn mã PHP

source: Code
vi: Đoạn mã

source: Fields
vi: Các trường

source: <none>
vi: <rỗng>

source: Allowed values list
vi: Danh sách các giá trị được phép

source: The possible values this field can contain. Enter one value per line, in the format key|label. The key is the value that will be stored in the database and it must match the field storage type, %type. The label is optional and the key will be used as the label if no label is specified.
vi: Các giá trị mà trường này có thể chứa. Nhập một giá trị vào mỗi dòng, với định dạng khóa|nhãn. Khóa là giá trị được lưu trữ ở cơ sở dữ liệu, nó phải trùng khớp với kiểu lưu trữ của trường. Nhãn là một tùy chọn và khóa sẽ được sử dụng như nhãn nếu nhãn không được thiết lập.

source: Advanced Usage Only: PHP code that returns a keyed array of allowed values. Should not include &lt;?php ?&gt; delimiters. If this field is filled out, the array returned by this code will override the allowed values list above.
vi: Chỉ sử dụng nâng cao: Đoạn mã PHP trả về một mảng khóa của các giá trị được phép. Không nên bao gồm dấu giới hạn &lt;?php ?&gt;. Nếu trường này được điền vào, mảng được trả về bởi đoạn mã này sẽ chép đè lên các giá trị được phép được liệt kê ở trên.

source: The content fields table %name has been created.
vi: Bảng các trường nội dung %name đã được tạo.

source: Content fields table %old_name has been renamed to %new_name and field instances have been updated.
vi: Bảng các trường nội dung %old_name đã được đổi tên thành %new_name và các thực thể trường (field instances) đã được cập nhật.

source: The content fields table %name has been deleted.
vi: Bảng các trường nội dung %name đã được xóa.

source: Group multiple values
vi: Nhóm lại các trường đa giá trị

source: Do not group multiple values
vi: Không nhóm lại các trường đa giá trị

source: Configure how this content type's fields and field labels should be displayed when it's viewed in teaser and full-page mode.
vi: Cấu hình cách trình bày giá trị của trường và nhãn của trường ở bản cắt và ở trang đầy đủ.

source: Edit
vi: Sửa

source: Manage fields
vi: Quản lý trường

source: Display fields
vi: Trình bày trường

source: Remove field
vi: Bỏ trường

source: content
vi: nội dung

source: Create a list of options as a list in <strong>Allowed values</strong> or as an array in Php code at the bottom of this page. These values will be the same for the %field in all content types.
vi: Tạo một danh sách các tùy chọn giống như danh sách trong <strong>Các giá trị được phép</strong> hay là giống như một mảng trong đoạn mã PHP ở phía dưới của trang này. Những giá trị cho %field sẽ áp dụng ở mọi kiểu nội dung.

source: For a single on/off checkbox, define the 'off' value first, then the 'on' value in the <strong>Allowed values</strong> section.
vi: Với hộp chọn đơn bật/tắt, định nghĩa giá trị 'tắt' trước, tiếp sau, giá trị 'bật' trong mục <strong>Các giá trị được phép</strong>

source: Plain text
vi: Bản văn thuần

source: Filtered text (user selects input format)
vi: Bản văn được lọc (người dùng chọn định dạng dữ liệu nhập)

source: Text processing
vi: Xử lý

source: %label is longer than %max characters.
vi: %label dài hơn % ký tự tối đa.

source: User roles that can be referenced
vi: Các vai trò người dùng có thể được tham khảo tới

source: %name : Invalid user.
vi: %name: Tên không hợp lệ

source: Field name
vi: Tên trường

source: Field type
vi: Kiểu trường

source: Used in
vi: Được sử dụng trong

source: There are no groups configured for this content type.
vi: Không có nhóm nào được cấu hình cho kiểu nội dung này.

source: There are no fields configured for this content type.
vi: Không có trường nào được cấu hình cho kiểu nội dung này.

source: group
vi: nhóm

source: configure
vi: cấu hình

source: remove
vi: bỏ đi

source: body
vi: phần thân

source: Update
vi: Cập nhật

source: Name
vi: Tên

source: Type
vi: Kiểu

source: Weight
vi: Độ nặng

source: Operations
vi: Các thao tác

source: No fields have been added to this group.
vi: Chưa có trường nào được thêm vào nhóm này.

source: Updated field groups.
vi: Đã cập nhật nhóm các trường.

source: Updated group weights.
vi: Đã cập nhật độ nặng của các nhóm.

source: Updated field weights.
vi: Đã cập nhật độ nặng của các trường.

source: Field
vi: Trường

source: Your settings have been saved.
vi: Các thiết lập của bạn đã được lưu lại

source: Teaser
vi: Bản cắt

source: Full
vi: Bản đầy đủ

source: Add existing field
vi: Thêm trường đã có

source: Create new field
vi: Tạo trường mới

source: The machine-readable name of the field.<br/>Allowed characters : unaccentuated a-z, numbers and _. All other characters will be discarded.<br/>You'll be able to choose a human-readable label for the field on next page
vi: Tên của trường dành cho máy đọc.<br />Các ký tự cho phép: a-z (không viết in), 0-9 và dấu _. Các ký tự khác đều bị loại bỏ.<br />Bạn sẽ có thể chọn nhãn dễ đọc cho trường ở trang kế

source: Create field
vi: Tạo trường

source: No field modules are enabled. You need to <a href="!modules_url">enable one</a>, such as text.module, before you can add new fields.
vi: Không có module trường nào được kích hoạt. Bạn cần <a href="!modules_url">kích hoạt</a> ít nhất là một, như text.module, trước khi bạn tạo ra các trường mới.

source: Added field %label.
vi: Đã thêm trường %label.

source: The field name %field_name already exists.
vi: Tên trường %field_name đã tồn tại.

source: The field name %field_name is invalid.
vi: Tên trường %field_name không hợp lệ.

source: Created field %label.
vi: Đã tạo trường %label.

source: Are you sure you want to remove the field %field?
vi: Bạn có chắc là muốn xóa trường %field?

source: If you have any content left in this field, it will be lost. This action cannot be undone.
vi: Nếu bạn có nội dung nào ở trong trường này, nó sẽ bị mất. Thao tác này không thể hoàn hồi.

source: Removed field %field from %type.
vi: Đã bỏ đi trường %field khỏi %type.

source: Widget settings
vi: Các thiết lập widget

source: These settings apply only to the %field field as it appears in the %type content type.
vi: Các thiết lập này chỉ áp dụng cho trường $field khi nó hiển thị trong kiểu nội dung %type.

source: Instructions to present to the user below this field on the editing form.
vi: Phần hướng dẫn, được trình bày cho người dùng, ở phía dưới trường này trong biểu mẫu soạn thảo.

source: Default value
vi: Giá trị mặc định

source: Advanced Usage Only: PHP code that returns a default value. Should not include &lt;?php ?&gt; delimiters.<br/>If this field is filled out, the value returned by this code will override any value in the textfield above.<br/>Expected format : @sample.
vi: Chỉ sử dụng nâng cao: Đoạn mã PHP trả về giá trị mặc định. Không nên bao gồm dấu phân cách &lt;?php ?&gt;.<br />Nếu trường này được điền giá trị vào, giá trị được đoạn mã này trả về sẽ được chép đè lên các giá trị được liệt kê ở trên.<br />Định dạng mẫu:@sample.

source: Data settings
vi: Các thiết lập dữ liệu

source: These settings apply to the %field field in every content type in which it appears.
vi: Các thiết lập áp dụng cho trường %field trong mỗi kiểu nội dung mà nó xuất hiện.

source: Required
vi: Yêu cầu

source: Multiple values
vi: Đa giá trị

source: Save field settings
vi: Lưu các thiết lập trường

source: The default value php code returned an incorrect value<br/>Expected format : @sample<br/>Returned value : @value
vi: Giá trị mặc định đoạn mã PHP trả về là giá trị không đúng.<br />Định dạng mẫu: @sample<br />Trả về giá trị: @value

source: The default value php code created @value which is invalid.
vi: Giá trị mặc định đoạn mã PHP tạo ra @value là không hợp lệ.

source: The default value is invalid.
vi: Giá trị mặc định không hợp lệ.

source: Saved field %field.
vi: Đã lưu trường %field.

source: No PostgreSQL mapping found for %type data type.
vi: Không tìm thấy ánh xạ PostgreSQL cho kiểu dữ liệu %type.

source: database
vi: cơ sở dữ liệu

source: Export
vi: Xuất ra

source: Import
vi: Nhập vào

source: This form will process a content type and one or more fields from that type and export the settings. The export created by this process can be copied and pasted as an import into the current or any other database. The import will add the fields to into an existing content type or create a new content type that includes the selected fields.
vi: Biểu mẫu này sẽ xử lý một kiểu nội dung vào một/nhiều trường từ kiểu nội dung đó và xuất ra các thiết lập. Bản xuất ra được tạo bởi quá trình xử lý này có thể được sao chép và dán vào cơ sở dữ liệu hiện tại hoặc cơ sở dữ liệu khác, sử dụng chức năng nhập vào. Chức năng nhập vào sẽ thêm các trường vào kiểu nội dung hiện có hoặc tạo một kiểu nội dung mới bao gồm các trường đã được chọn.

source: Types
vi: Các kiểu

source: Select the content type to export.
vi: Chọn kiểu nội dung để xuất ra.

source: Groups
vi: Các nhóm

source: Select the group definitions to export from %type.
vi: Chọn các định nghĩa nhóm để xuất ra từ %type.

source: Select the field definitions to export from %type.
vi: Chọn các định nghĩa trường để xuất ra từ %type.

source: Export data
vi: Xuất dữ liệu

source: Copy the export text and paste it into another content type using the import function.
vi: Sao chép phần văn bản xuất ra và dán nó vào một kiểu nội dung khác sử dụng chức năng nhập vào.

source: This form will import field definitions exported from another content type or another database.<br/>Note that fields cannot be duplicated within the same content type, so imported fields will be added only if they do not already exist in the selected type.
vi: Biểu mẫu này sẽ nhập vào các định nghĩa trường được xuất ra từ kiểu nội dung khác hoặc từ một cơ sở dữ liệu khác.<br />Chú ý rằng các trường không thể bị sao lại trong một kiểu nội dung, vì thế các trường nhập sẽ chỉ được thêm vào nếu chúng chưa tồn tại trong kiểu nội dung đã chọn.

source: <Create>
vi: <Tạo>

source: Content type
vi: Kiểu nội dung

source: Select the content type to import these fields into.<br/>Select <Create> to create a new content type to contain the fields.
vi: Chọn một kiểu nội dung để nhập những trường này vào.<br />Chọn <Tạo> để tạo một kiểu nội dung mới để chứa các trường này.

source: Import data
vi: Nhập dữ liệu

source: Paste the text created by a content export into this field.
vi: Dán vào bản văn được tạo bởi chức năng xuất nội dung vào trường này.

source: The import data is not valid import text.
vi: Dữ liệu nhập vào không phải là bản văn hợp lệ.

source: The following modules must be enabled for this import to work: %modules.
vi: Các module sau phải được kích hoạt để phần nhập dữ liệu có thể hoạt động: %modules.

source: <create>
vi: <tạo>

source: The content type %type already exists in this database.
vi: Kiểu nội dung %type đã tồn tại trong cơ sở dữ liệu này.

source: Exiting. No import performed.
vi: Thoát. Không thực hiện nhập dữ liệu.

source: An error has occured adding the content type %type.<br/>Please check the errors displayed for more details.
vi: Có lỗi xảy ra khi thêm vào kiểu dữ liệu %type.<br />Vui lòng kiểm tra các lỗi được trình bày để có thêm chi tiết.

source: The imported field %field_label (%field_name) was not added to %type because that field already exists in %type.
vi: Trường %field_label (%field_name) nhập vào không được thêm vào %type bởi vì trường đó đã tồn tại trong %type.

source: An error has occured adding the field %field_label (%field_name).<br/>Please check the errors displayed for more details.
vi: Có lỗi xảy ra khi thêm vào trường %field_label (%field_name).<br />Vui lòng kiểm tra các lỗi được trình bày để có thêm chi tiết.

source: The field %field_label (%field_name) was added to the content type %type, but an error has occured updating the field settings.<br/>Please check the errors displayed for more details.
vi: Trường $field_label (%field_name) đã được thêm vào kiểu nội dung %type, nhưng một lỗi đã xảy ra khi cập nhật các thiết lập của trường.<br />Vui lòng kiểm tra các lỗi được trình bày để cho thêm chi tiết.

source: Add group
vi: Thêm nhóm

source: Edit group
vi: Sửa nhóm

source: Add
vi: Thêm

source: Save
vi: Lưu

source: These settings apply to the group in the node editing form
vi: Các thiết lập này áp dụng cho nhóm trong biểu mẫu soạn thảo

source: style
vi: phong cách

source: always open
vi: luôn mở

source: collapsible
vi: có thể thâu gọn

source: collapsed
vi: thâu gọn

source: Instructions to present to the user on the editing form.
vi: PHần hướng dẫn trình bày cho người dùng trên biểu mẫu soạn thảo.

source: These settings apply to the group on node display.
vi: Các thiết lập này ấp dụng cho nhóm khi trình bày node.

source: Description
vi: Mô tả

source: A description of the group.
vi: Phần mô tả cho nhóm.

source: The group name %name already exists.
vi: Tên nhóm %name đã tồn tại.

source: The group name %name is invalid.
vi: Tên nhóm %group không hợp lệ.

source: Are you sure you want to remove the group %label?
vi: Bạn có chắc muốn xóa nhóm %label?

source: This action cannot be undone.
vi: Thao tác này không thể hoàn hồi.

source: No group
vi: Không có nhóm.

source: Display in group
vi: Trình bày trong nhóm

source: Select a group, in which the field will be displayed on the editing form.
vi: Chọn một nhóm, trong đó trường sẽ được trình bày trong biểu mẫu soạn thảo.

source: no styling
vi: không phong cách

source: simple
vi: đơn giản

source: fieldset - collapsible
vi: fieldset - có thể thâu gọn

source: fieldset - collapsed
vi: fieldset - thâu gọn

source: node reference autocomplete
vi: tự động tham khảo node

source: Content types that can be referenced
vi: Các kiểu nội dung có thể được tham khảo

source: Existing Views
vi: Views đã tồn tại

source: Default Views
vi: Views mặc định

source: Advanced - Nodes that can be referenced (View)
vi: Nâng cao - Các node có thể được tham khảo (View)

source: View
vi: Xem

source: Choose the "Views module" view that selects the nodes that can be referenced.<br>Note :<ul><li>This will discard the "Content types" settings above. Use the view's "filters" section instead.</li><li>Use the view's "fields" section to display additional informations about candidate nodes on node creation/edition form.</li><li>Use the view's "sort criteria" section to determine the order in which candidate nodes will be displayed.</li></ul>
vi: Chọn view ( được tạo ra bởi module "Views module"), chỉ những node được chọn ra bởi view này mới có thể được tham khảo.<br>Ghi chú:<ul><li>Thiết lập này sẽ bỏ qua các thiết lập "Các kiểu nội dung" ở trên. Use the view's "filters" section instead.</li><li>Sử dụng view's "fields" section để trình bày thêm thông tin về candidate nodes trên biểu mẫu soạn thảo node.</li><li>Sử dụng the view's "sort criteria" section to determine the order in which candidate nodes will be displayed.</li></ul>

source: View arguments
vi: Các tham số View

source: Provide a comma separated list of arguments to pass to the view.
vi: Dấu phẩy phân cách các tham số truyền vào view.

source: %name : This post can't be referenced.
vi: %name: Bài viết này không thể được tham khảo.

source: %name : Title mismatch. Please check your selection.
vi: %name: Tiêu đề không trùng khớp. Xin kiểm tra lại chọn lựa của bạn.

source: <empty>
vi: <rỗng>

source: Minimum
vi: Tối thiểu

source: Maximum
vi: Tối đa

source: Prefix
vi: Tiền tố

source: Define a string that should be prefixed to the value, like $ or €. Leave blank for none. Separate singular and plural values with a pipe (pound|pounds).
vi: Định nghĩa một chuỗi làm tiền tố cho giá trị, như $ hay €. Để trống nếu không muốn. Phân biệt giá trị số ít với số nhiều bằng dấu đứng (thí dụ: pound|pounds).

source: Suffix
vi: Hậu tố

source: Define a string that should suffixed to the value, like m², m/s², kb/s. Leave blank for none. Separate singular and plural values with a pipe (pound|pounds).
vi: Định nghĩa một chuỗi làm hậu tố cho giá trị, như m², m/s², kb/s. Để trống nếu không muốn. Phân biệt giá trị số ít với số nhiều bằng dấu đứng (thí dụ: pound|pounds).

source: "Minimum" must be a number.
vi: "Tối thiểu" phải là một số.

source: "Maximum" must be a number.
vi: "Tối đa" phải là một số.

source: The value of %name may be no smaller than %min.
vi: Giá trị của %name phải không nhỏ hơn %min.

source: The value of %name may be no larger than %max.
vi: Giá trị của %name phải không lớn hơn %max

source: <div>The allowed values list for %field was updated from </div><pre>%start</pre><div> to </div><pre>%end</pre><div>You can go to the field settings page to give each option a more user-friendly label.
vi: <div>Danh sách các giá trị được phép cho %field đã được cập nhật từ <div> <pre>%start</pre><div>đến</div><pre>%end</pre><div>Bạn có thể đến trang cấu hình trường để gắn nhãn, thân thiện hơn với người dùng.

source: <div>The allowed values list for %field was not changed from </div><pre>%start</pre>
vi: <div>Danh sách các giá trị được phép cho %field không được thay đổi từ <pre>%start</pre>

source: Content
vi: Nội dung

source: Allows administrators to define new content types.
vi: Cho phép người điều hành định nghĩa các kiểu nội dung mới.

source: Content Copy
vi: Sao chép nội dung

source: Enables ability to import/export field definitions.
vi: Kích hoạt khả năng nhập/xuất các định nghĩa trường.

source: Create field groups for CCK fields.
vi: Tạo các nhóm trường cho các trường CCK.

source: Node Reference
vi: Tham khảo Node

source: Defines a field type for referencing one node from another.
vi: Định nghĩa

source: Number
vi: Số

source: Defines numeric field types.
vi: Định nghĩa các trường số

source: Option Widgets
vi: Các widget tùy chọn

source: Defines selection, check box and radio button widgets for text and numeric fields.
vi: Định nghĩa chọn lựa, hộp kiểm tra và các nút radio cho bản văn và các trường số.

source: Text
vi: Bản văn

source: Defines simple text field types.
vi: Định nghĩa các kiểu trường bản văn đơn giản.

source: User Reference
vi: Tham khảo người dùng

source: Defines a field type for referencing a user from a node.
vi: Định nghĩa một kiểu trường để tham khảo đến một người dùng từ một node.
